A Subregion cannot be created outside the boundary of a Toposurface. A Subregion should be completely inside a Toposurface or overlap a Toposurface.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SubregionNoHostSurf { get; }
  Visual Basic
Public Shared ReadOnly Property SubregionNoHostSurf As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SubregionNoHostSurf {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace